There is no solution for this view. All the elements have been filtered for this view, select another view, and select solutions.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoSolutionInView { get; }
  Visual Basic
Public Shared ReadOnly Property NoSolutionInView As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoSolutionInView {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AutoRouteFailures Class
  Autodesk.Revit.DB Namespace